Repository: klyok/DC.OmegaT
Catalog: DC++/omegat/project_save.tmx
Source language: en
Languages: be

source: - %z, %Z - Either the time-zone name or time zone abbreviation, depending on registry settings; no characters if time zone is unknown
be: %z, %Z — або назва часавага пасу, або ягонае скарачэньне — залежыць ад наладаў рэестру; калі невядома, які пас, нічога ня пішацца

source: - &quot;Low delay&quot;
be: — «малая затрымка»

source: - &quot;Minimal cost&quot;
be: — «нізкі кошт»

source: - &quot;Reliability&quot;
be: — «надзейнасьць»

source: - &quot;Throughput&quot;
be: — «прадукцыйнасьць»

source: - 'Active' check box selects if the search is used or not.
be: 1. Птушачка «Задзейнічаны» паказвае, ці выкарыстоўваецца гэты пошук.

source: - 'Destination Directory' selects the special output folder for a search.
be: 3. «Прызначаны каталёґ» вызначае адмысловы каталёґ на вынікі пошуку.

source: - 'Min/Max Size' sets file size limits.
be: 4. «Найменшы, найбольшы памер» абмяжоўвае памеры файлаў.

source: - 'Move Up'/'Move Down' can be used to organize the list of searches.
be: 5. «Вышэй» і «Ніжэй» можна выкарыстоўваць, каб ладзіць сьпіс пошукаў.

source: - 'Source Type' can be the following options; 'Filename' matches search against filename,
be: — «Від крыніцы» можа быць наступным:

source: - 'Source Type' can be the following options; 'Filename' matches search against filename, 'Directory' matches against current subdirectory and places the whole structure in the special folder, 'Full Path' matches against whole directory + filename.
be: 2. «Від крыніцы» можа быць наступным: «Назва файла» — шукаем у назвах файлаў, «Каталёґ» — шукаем у назвах каталёґаў (увесь каталёґ з падкаталёґамі адлюструецца ў адмысловым каталёґу), «Поўны шлях» — шукаем у назвах і файлаў, і каталёґаў.

source: -%[down] - data downloaded
be: %[down] — сьцягнулі

source: -%[ratio] - up/down ratio
be: %[ratio] — суадносіны зацягнулі/сьцягнулі

source: -%[up] - data uploaded
be: %[up] — зацягнулі

source: -- -- Don't use passive search if you have search results without this option -- -- because you don't get search result from passive clients !!!
be: -- -- Не карыстайцеся нядзейным пошукам, калі можаце хоць-што знайсьці безь яго, -- -- таму што вы не атрымваеце вынікаў ад нядзейных кліентаў!!!

source: -- -- Turn it off in settings => ApexDC++ => Always use Passive Mode for Search --
be: -- -- Вылучыце гэта ў наладжваньнях => ApexDC++ => (Адмысловыя — Заўжды шукаць нядзейным спосабам) --

source: -- -- Turn it off in settings => FlylinkDC++ => Always use Passive Mode for Search --
be: -- -- Вылучыце гэта ў наладах => FlylinkDC++ => (Адмысловыя — Заўжды шукаць нядзейным спосабам) --

source: -- -- Turn it off in settings => StrongDC++ => Always use Passive Mode for Search --
be: -- -- Вылучыце гэта ў наладжваньнях => StrongDC++ => (Адмысловыя — Заўжды шукаць нядзейным спосабам) --

source: -- -- Вылучыце гэта ў наладжваньнях => FlylinkDC++ => («Адмысловыя» — «Заўсёды шукаць нядзейным спосабам») --
be: -- -- Вылучыце гэта ў наладжваньнях FlylinkDC++ («Адмысловыя» -&gt; «Заўсёды шукаць нядзейным спосабам») --

source: -- Don't use passive search if you have search results without this option --
be: -- Не карыстайцеся нядзейным пошукам, калі можаце хоць-што знайсьці безь яго, --

source: -- Separator --
be: — Аддзяляльнік —

source: -- Turn it off in settings => ApexDC++ => Always use Passive Mode for Search --
be: -- Забараніце гэта: прыбярыце птушачку «Налады» > «Адмысловыя» > «Заўжды шукаць нядзейным спосабам» --

source: -- Turn it off in settings => FlylinkDC++ => Always use Passive Mode for Search --
be: -- Забараніце гэта: прыбярыце птушачку «Налады» > «Адмысловыя» > «Заўжды шукаць нядзейным спосабам» --

source: -- Turn it off in settings => StrongDC++ => Always use Passive Mode for Search --
be: -- Забараніце гэта: прыбярыце птушачку «Налады» > «Адмысловыя» > «Заўжды шукаць нядзейным спосабам» --

source: -- WARNING --
be: -- ПЕРАСЬЦЯРОГА --

source: -- WARNING -- -- You are in active mode, but have activated passive search.
be: -- ПЕРАСЬЦЯРОГА -- -- Вы карыстаецеся дзейным спосабам злучацца, але шукаеце — нядзейна.

source: -- You are in active mode, but have activated passive search.
be: -- Вы карыстаецеся дзейным спосабам злучацца, але шукаеце — нядзейна.

source: -- because you don't get search result from passive clients !!!
be: -- таму што вы не атрымваеце вынікаў ад нядзейных кліентаў!!!

source: -- because you don't get search result from passive clients!!!
be: -- таму што вы не атрымваеце вынікаў ад нядзейных кліентаў!!!

source: -.-- B/s, %1 left
be: -.-- Б/с, засталося %1

source: -.-- files/h, %1 files left
be: -.-- файлаў за гадзіну, засталося файлаў: %1

source: -:--:-- left
be: -:--:-- засталося

source: -h, --help Show this message
be: -h, --help Паказвае гэтае паведамленьне

source: -v, --version Show version string
be: -v, --version Паказвае радок з вэрсіяй

source: ...must be *.theme
be: …мусіць заканчвацца на «.theme»

source: ...must not be empty
be: …нельга, каб было пустым

source: /alias <ALIAS_NAME>::<COMMAND> - make alias /ALIAS_NAME to /COMMAND
be: /alias <НАЗОЎКА>::<ЗАГАД> — стварыць назоўку /НАЗОЎКА да загаду /ЗАГАД

source: /alias list - list all aliases
be: /alias list — пералічыць усе назоўкі

source: /alias purge <ALIAS_NAME> - remove alias
be: /alias purge <НАЗОЎКА> — выкрасьліць назоўку

source: /aspell on/off - enable/disable spell checking
be: /aspell on/off — спраўджваць (on) ці ня спраўджваць (off) правапіс

source: /away <message> - set away-mode on/off
be: /away <паведамленьне> — перайсьці ў стан «адсутнічаю» ці вярнуцца

source: /back - set away-mode off
be: /back — вярнуцца са стану «адсутнічаю»

source: /browse <nick> - browse user files
be: /browse <мянушка> — зірнуць файлы карыстальніка

source: /clear - clear chat window
be: /clear — ачысьціць ваконца гаманы

source: /close - close this hub
be: /close — зачыніць гэты асяродак

source: /fav - add this hub to favorites
be: /fav — дадаць гэты асяродак да ўлюбёных

source: /grant <nick> - grant extra slot to user
be: /grant <мянушка> — дадаць шчыліну карыстальніку

source: /help, /?, /h - show this help
be: /help, /?, /h — паказаць дапамогу (тое, што вы зараз чытаеце)

source: /info <nick> - show info about user
be: /info <мянушка> — паказаць зьвесткі пра карыстальніка

source: /itunes - For iTunes media spamming
be: /itunes — каб апавяшчаць зьвесткі iTunes

source: /itunes - For iTunes media spamming - %[version] Numerical Version (ex: 7.0.2.16) - %[album] Name of the album the current track is from - %[artist] Artist of the current track - %[title] Name of the currently playing track - %[genre] Genre of the currently playing track - %[elapsed] Time elapsed in minutes:seconds - %[percent] Time elapsed presented as percentage from total length - %[bar] ASCII progress bar, 10 characters wide no including brackets (ex. [----|-----]) - %[length] Total length of the current track - %[bitrate] Bitrate for the playing track (kbps) - %[frequency] Frequency for the currently playing track (kHz) - %[year] Year of publiciation/recording of the current track - %[size] Size of the currently playing file - %[state] Current state of iTunes (playing/stopped) Empty = Default String -> +me playing: %[title] at %[bitrate] <iTunes %[version]>
be: /itunes — Каб апавяшчаць зьвесткі iTunes %[version] Нумар вэрсіі (пр., 7.0.2.16) %[album] Назоў альбому, да якога належыць бягучая песьня %[artist] Імя выканаўцы бягучае песьні %[title] Назоў таго, што зараз грае %[genre] Жанр бягучае песьні %[elapsed] Колькі часу засталося (хвіліны:сэкунды) %[percent] Колькі часу засталося ў адсотках ад агульнай працягласьці %[bar] Радок поступу (у ASCII), даўжыня — 10 знакаў бяз дужак (пр., [----|-----]) %[length] Поўная працягласьць бягучага файла %[bitrate] Колькасьць бітаў за сэкунду ў бягучым файле (kbps) %[frequency] Частата бягучага файла (kHz) %[year] Год, калі выпусьцілі ці запісалі бягучую дарожку %[size] Памер бягучага файла %[state] Бягучы стан iTunes (грае/спынены) Пуста = Прадвызначаны радок —> +me playing: %[title] at %[bitrate] <iTunes %[version]>

source: /itunes - For iTunes media spamming - %[version] - version (ex: 10.0.1.22) - %[album] - name of the album the current track is from - %[artist] - artist of the current track - %[title] - name of the currently playing track - %[genre] - genre of the currently playing track - %[elapsed] - time elapsed in minutes:seconds - %[percent] - time elapsed presented as percentage from total length - %[bar] - ASCII progress bar, 10 characters wide no including brackets (ex. [----|-----]) - %[length] - total length of the current track - %[bitrate] - bitrate for the playing track (kbps) - %[frequency] - frequency for the currently playing track (kHz) - %[year] - year of publiciation/recording of the current track - %[size] - size of the currently playing file - %[state] - current state of iTunes (playing/stopped) Empty = Default String -> +me listens %[artist] - %[title] • listened to %[percent] (%[length], %[bitrate], iTunes %[version])
be: /itunes — Каб апавяшчаць зьвесткі iTunes %[version] — нумар вэрсіі (пр., 10.0.1.22) %[album] — назоў альбому, да якога належыць бягучая песьня %[artist] — імя выканаўцы бягучае песьні %[title] — назоў таго, што зараз грае %[genre] — жанр бягучае песьні %[elapsed] — колькі часу засталося (хвіліны:сэкунды) %[percent] — колькі часу засталося ў адсотках ад агульнай працягласьці %[bar] — радок поступу (у ASCII), даўжыня — 10 знакаў бяз дужак (пр., [----|-----]) %[length] — поўная працягласьць бягучага файла %[bitrate] — колькасьць бітаў за сэкунду ў бягучым файле (kbps) %[frequency] — чашчыня бягучага файла (kHz) %[year] — год, калі выпусьцілі ці запісалі бягучую дарожку %[size] — памер бягучага файла %[state] — бягучы стан iTunes (грае/спынены) Пуста = звычайны радок —> +me listens %[artist] - %[title] • listened to %[percent] (%[length], %[bitrate], iTunes %[version])

source: /itunes - For iTunes media spamming - %[version] - version (ex: 7.0.2.16) - %[album] - name of the album the current track is from - %[artist] - artist of the current track - %[title] - name of the currently playing track - %[genre] - genre of the currently playing track - %[elapsed] - time elapsed in minutes:seconds - %[percent] - time elapsed presented as percentage from total length - %[bar] - ASCII progress bar, 10 characters wide no including brackets (ex. [----|-----]) - %[length] - total length of the current track - %[bitrate] - bitrate for the playing track (kbps) - %[frequency] - frequency for the currently playing track (kHz) - %[year] - year of publiciation/recording of the current track - %[size] - size of the currently playing file - %[state] - current state of iTunes (playing/stopped) Empty = Default String -> +me playing: %[title] at %[bitrate] <iTunes %[version]>
be: /itunes — Каб апавяшчаць зьвесткі iTunes %[version] — нумар вэрсіі (пр., 7.0.2.16) %[album] — назоў альбому, да якога належыць бягучая песьня %[artist] — імя выканаўцы бягучае песьні %[title] — назоў таго, што зараз грае %[genre] — жанр бягучае песьні %[elapsed] — колькі часу засталося (хвіліны:сэкунды) %[percent] — колькі часу засталося ў адсотках ад агульнай працягласьці %[bar] — радок поступу (у ASCII), даўжыня — 10 знакаў бяз дужак (пр., [----|-----]) %[length] — поўная працягласьць бягучага файла %[bitrate] — колькасьць бітаў за сэкунду ў бягучым файле (kbps) %[frequency] — чашчыня бягучага файла (kHz) %[year] — год, калі выпусьцілі ці запісалі бягучую дарожку %[size] — памер бягучага файла %[state] — бягучы стан iTunes (грае/спынены) Пуста = Прадвызначаны радок —> +me playing: %[title] at %[bitrate] <iTunes %[version]>

source: /ja - For JetAudio spamming
be: /ja — каб апавяшчаць зьвесткі JetAudio

source: /kword add <keyword> - add user-defined keyword
be: /kword add <ключавое_слова> — дадаць вызначае карыстальнікам ключавое слова

source: /kword list - list all keywords
be: /kword list — пералічыць усе ключавыя словы

source: /kword purge <keyword> - remove user-defined keyword
be: /kword purge <ключавое_слова> — выкрасьліць вызначанае карыстальнікам ключавое слова

source: /lua <chunk> - execute Lua chunk
be: /lua <скрыпт> — выканаць скрыпт Lua

source: /luafile <file> - load Lua file
be: /luafile <файл> — прачытаць файл Lua

source: /magnet - default action with magnet (0-ask, 1-search, 2-download)
be: /magnet — дзеяньне па маґніт-спасылцы (0 — запытацца, 1 — шукаць, 2 — сьцягнуць)

source: /me - say a third person
be: /me — сказаць ад трэцяе асобы

source: /mpc - For Media Player Classic media spamming
be: /mpc — каб апавяшчаць зьвесткі Media Player Classic

source: /mpc - For Media Player Classic media spamming - %[filename] Name of the file currently playing - %[title] Name of the cyrrently playing item (without file extension) - %[size] Size of the file currently playing - %[state] Current state of Media Player Classic (playing/paused/stopped) - %[elapsed] Time elapsed in minutes:seconds - %[percent] Time elapsed presented as percentage from total length - %[bar] ASCII progress bar, 10 characters wide no including brackets (ex. [----|-----]) - %[length] Total length of the current file Empty = Default String -> +me playing: %[title] <Media Player Classic>
be: /mpc — Каб апавяшчаць зьвесткі Media Player Classic %[filename] Назоў файла, што зараз грае %[title] Назоў таго, што зараз грае (без пашырэньня файла) %[size] Памер бягучага файла %[state] Бягучы стан Media Player Classic (грае/прыпынены/спынены) %[elapsed] Колькі часу засталося (хвіліны:сэкунды) %[percent] Колькі часу засталося ў адсотках ад агульнай працягласьці %[bar] Радок поступу (у ASCII), даўжыня — 10 знакаў бяз дужак (пр., [----|-----]) %[length] Поўная працягласьць бягучага файла Пуста = Прадвызначаны радок —> +me playing: %[title] <Media Player Classic>

source: /mpc - For Media Player Classic media spamming - %[filename] - name of the file currently playing - %[title] - name of the cyrrently playing item (without file extension) - %[size] - size of the file currently playing - %[state] - current state of Media Player Classic (playing/paused/stopped) - %[elapsed] - time elapsed in minutes:seconds - %[percent] - time elapsed presented as percentage from total length - %[bar] - ASCII progress bar, 10 characters wide no including brackets (ex. [----|-----]) - %[length] - total length of the current file Empty = Default String -> +me playing: %[title] (Media Player Classic)
be: /mpc — Каб апавяшчаць зьвесткі Media Player Classic %[filename] — назоў файла, што зараз грае %[title] — назоў таго, што зараз грае (без пашырэньня файла) %[size] — памер бягучага файла %[state] — бягучы стан Media Player Classic (грае/прыпынены/спынены) %[elapsed] — колькі часу засталося (хвіліны:сэкунды) %[percent] — колькі часу засталося ў адсотках ад агульнай працягласьці %[bar] — радок поступу (у ASCII), даўжыня — 10 знакаў бяз дужак (пр., [----|-----]) %[length] — поўная працягласьць бягучага файла Пуста = звычайны радок —> +me playing: %[title] (Media Player Classic)

source: /mpc - For Media Player Classic media spamming - %[filename] - name of the file currently playing - %[title] - name of the cyrrently playing item (without file extension) - %[size] - size of the file currently playing - %[state] - current state of Media Player Classic (playing/paused/stopped) - %[elapsed] - time elapsed in minutes:seconds - %[percent] - time elapsed presented as percentage from total length - %[bar] - ASCII progress bar, 10 characters wide no including brackets (ex. [----|-----]) - %[length] - total length of the current file Empty = Default String -> +me playing: %[title] <Media Player Classic>
be: /mpc — Каб апавяшчаць зьвесткі Media Player Classic %[filename] — назоў файла, што зараз грае %[title] — назоў таго, што зараз грае (без пашырэньня файла) %[size] — памер бягучага файла %[state] — бягучы стан Media Player Classic (грае/прыпынены/спынены) %[elapsed] — колькі часу засталося (хвіліны:сэкунды) %[percent] — колькі часу засталося ў адсотках ад агульнай працягласьці %[bar] — радок поступу (у ASCII), даўжыня — 10 знакаў бяз дужак (пр., [----|-----]) %[length] — поўная працягласьць бягучага файла Пуста = Прадвызначаны радок —> +me playing: %[title] <Media Player Classic>

source: /pm <nick> - begin private chat with user
be: /pm <мянушка> — пачаць гутарыць асабіста з карыстальнікам

source: /ratio [show] - show ratio [send in chat]
be: /ratio [show] — паказаць суадносіны [паказаць усім у гутарцы]

source: /s
be: /с

source: /sh <command> - start command and redirect output to the chat
be: /sh <загад> — выканаць загад і накіраваць вынік у гутарку

source: /winamp - Works with 1.x, 2.x, 5.x (no WinAmp 3 support)
be: /winamp — працуе з 1.x, 2.x, 5.x (Winamp 3 не падтрымваецца)

source: /winamp - Works with 1.x, 2.x, 5.x (no WinAmp 3 support) - %[version] Numerical Version (ex: 2.91) - %[state] Playing state (ex: stopped/paused/playing) - %[title] Window title from Winamp - if you want to change this for mp3s, Winamp > Pref > Input > MPEG > Title - %[rawtitle] Window title from Winamp (if %[title] not working propertly) - %[percent] Percentage (ex. 40%) - %[length] Length in minutes:seconds (ex: 04:09) - %[elapsed] Time elapsed in minutes:seconds (ex. 03:51) - %[bar] ASCII progress bar, 10 characters wide no including brackets (ex. [----|-----]) - %[bitrate] Bitrate (ex. 128kbps) - %[sample] Sample frequency (ex. 22kHz) - %[channels] Number of channels (ex. stereo / mono) Empty = Default String -> winamp(%[version]) %[state](%[title]) stats(%[percent] of %[length] %[bar])
be: /winamp — Працуе з Winamp 1.x, 2.x, 5.x (Winamp 3 не падтрымліваецца) %[version] Нумар вэрсіі (пр., 2.91) %[state] Стан прайграваньня (пр., спынены/прыпынены/грае) %[title] Загаловак вакна Winamp — калі вы хочаце зьмяніць яго, Winamp > Pref > Input > MPEG > Title %[rawtitle] Загаловак вакна Winamp (калі %[title] не працуе як належыць) %[percent] Адсотак (пр., 40%) %[length] Працягласьць як "хвіліны:сэкунды" (пр., 04:09) %[elapsed] Мінула часу (як "хвіліны:сэкунды", пр., 03:51) %[bar] Стужка поступу (у ASCII), даўжыня — 10 знакаў бяз дужак (пр., [----|-----]) %[bitrate] Бітаў за сэкунду (пр., 128kbps) %[sample] Чашчыня (пр., 22kHz) %[channels] Колькасьць каналаў (пр., стэрэа / мона) Пуста = прадвызначаны радок —> winamp(%[version]) %[state](%[title]) stats(%[percent] of %[length] %[bar])

source: /winamp - Works with Winamp 1.x, 2.x, 5.x (no Winamp 3 support)
be: /winamp — працуе з Winamp 1.x, 2.x, 5.x (Winamp 3 не падтрымваецца)

source: /winamp - Works with Winamp 1.x, 2.x, 5.x (no Winamp 3 support) - %[version] - version (ex: 5.58) - %[state] - playing state (ex: stopped/paused/playing) - %[title] - window title from Winamp. If you want to change this for mp3s, Winamp > Pref > Input > MPEG > Title - %[rawtitle] - window title from Winamp (if %[title] not working propertly) - %[percent] - percentage (ex. 40%) - %[length] - length (ex: 09:00) - %[elapsed] - time elapsed (ex. 07:51) - %[bar] - ASCII progress bar, 10 characters wide no including brackets (ex. [----|-----]) - %[bitrate] - bitrate (ex. 707kbps) - %[sample] - sample frequency (ex. 44kHz) - %[channels] - number of channels (ex. stereo / mono) - %[magnet] - magnet to current file (if not shared - show only filename ) Empty = Default String: +me listen: %[artist] - %[elapsed] %[track] - %[title] • listened to %[percent] (%[length], %[bitrate], Winamp %[version]) Note about The KMPlayer: You can use most of the features offered by /winamp command and all features of the media toolbar also with The KMPlayer. Parameters that are known not to work (or return incorrect values) are %[version], %[bitrate], %[sample] and %[channels]. It's also very likely that you will need to use %[rawtitle] instead of %[title] to get the correct output.
be: /winamp — Працуе з Winamp 1.x, 2.x, 5.x (Winamp 3 не падтрымліваецца) %[version] — нумар вэрсіі (пр., 5.58) %[state] — стан прайграваньня (пр., спынены/прыпынены/грае) %[title] — загаловак вакна Winamp — калі вы хочаце зьмяніць яго, Winamp > Pref > Input > MPEG > Title %[rawtitle] — загаловак вакна Winamp (калі %[title] не працуе як належыць) %[percent] — адсотак (пр., 40%) %[length] — працягласьць (пр., 09:00) %[elapsed] — мінула часу (пр., 03:51) %[bar] — стужка поступу (у ASCII), даўжыня — 10 знакаў бяз дужак (пр., [----|-----]) %[bitrate] — бітаў за сэкунду (пр., 707kbps) %[sample] — чашчыня (пр., 44kHz) %[channels] — колькасьць каналаў (пр., стэрэа / мона) %[magnet] — магніт-спасылка да бягучага файла (або назоў файла, калі файл не абагулілі) Пуста = звычайны радок: +me listen: %[artist] - %[elapsed] %[track] - %[title] • listened to %[percent] (%[length], %[bitrate], Winamp %[version]) Заўвагі да KMPlayer: Вы можаце выкарыстоўваць большасьць магчымасьцяў, што прапануюцца загадам /winamp і ўсе магчымасьці паліцы прайгравальніка таксама і з KMPlayer. Вось парамэтры, што не працуюць (ці вяртаюць памылковыя значэньні): %[version], %[bitrate], %[sample] і %[channels]. Бадай што вы таксама мусіце выкарыстоўваць %[rawtitle] заміж %[title], каб атрымаць слушны вынік.

source: /winamp - Works with Winamp 1.x, 2.x, 5.x (no Winamp 3 support) - %[version] - version (ex: 5.58) - %[state] - playing state (ex: stopped/paused/playing) - %[title] - window title from Winamp. If you want to change this for mp3s, Winamp > Pref > Input > MPEG > Title - %[rawtitle] - window title from Winamp (if %[title] not working propertly) - %[percent] - percentage (ex. 40%) - %[length] - length (ex: 09:00) - %[elapsed] - time elapsed (ex. 07:51) - %[bar] - ASCII progress bar, 10 characters wide no including brackets (ex. [----|-----]) - %[bitrate] - bitrate (ex. 707kbps) - %[sample] - sample frequency (ex. 44kHz) - %[channels] - number of channels (ex. stereo / mono) Empty = Default String: +me listen: %[artist] - %[elapsed] %[track] - %[title] • listened to %[percent] (%[length], %[bitrate], Winamp %[version]) Note about The KMPlayer: You can use most of the features offered by /winamp command and all features of the media toolbar also with The KMPlayer. Parameters that are known not to work (or return incorrect values) are %[version], %[bitrate], %[sample] and %[channels]. It's also very likely that you will need to use %[rawtitle] instead of %[title] to get the correct output.
be: /winamp — Працуе з Winamp 1.x, 2.x, 5.x (Winamp 3 не падтрымліваецца) %[version] — нумар вэрсіі (пр., 5.58) %[state] — стан прайграваньня (пр., спынены/прыпынены/грае) %[title] — загаловак вакна Winamp — калі вы хочаце зьмяніць яго, Winamp > Pref > Input > MPEG > Title %[rawtitle] — загаловак вакна Winamp (калі %[title] не працуе як належыць) %[percent] — адсотак (пр., 40%) %[length] — працягласьць (пр., 09:00) %[elapsed] — мінула часу (пр., 03:51) %[bar] — стужка поступу (у ASCII), даўжыня — 10 знакаў бяз дужак (пр., [----|-----]) %[bitrate] — бітаў за сэкунду (пр., 707kbps) %[sample] — чашчыня (пр., 44kHz) %[channels] — колькасьць каналаў (пр., стэрэа / мона) Пуста = прадвызначаны радок: +me listen: %[artist] - %[elapsed] %[track] - %[title] • listened to %[percent] (%[length], %[bitrate], Winamp %[version]) Заўвагі да KMPlayer: Вы можаце выкарыстоўваць большасьць магчымасьцяў, што прапануюцца загадам /winamp і ўсе магчымасьці паліцы прайгравальніка таксама і з KMPlayer. Вось парамэтры, што не працуюць (ці вяртаюць памылковыя значэньні): %[version], %[bitrate], %[sample] і %[channels]. Бадай што вы таксама мусіце выкарыстоўваць %[rawtitle] заміж %[title], каб атрымаць слушны вынік.
